{
  "hurricane":{
	  "key": "2",
    "title": "Deep Learning for Hurricane Forecasting",
    "description": "Living in South Florida, I have firsthand experience with inaccurate hurricane forecasts. In August of 2017, I was offered to be the Artificial Intelligence Project Lead for <a href='https://upe.cs.fiu.edu/sparkdev/'>Upsilon Pi Epsilon's SparkDev program</a>. I selected a group of six inexperienced students to complete a project in nine weeks. We implemented a prediction technique to predict the paths of hurricanes using a recurrent neural network. Using the knowledge I was learning from <a href='/generic_project.html?project=nanodegree'>Udacity's Deep Learning Nanodegree</a>, I was able to teach these students about the foundations of recurrent neural networks, and we were able to complete the project in the given time constraint successfully.</p><p>Upon completion of the project,  I decided to pursue this as an independent research project since we discovered that current hurricane forecasting techniques were not using deep learning. With the sporadic behavior of hurricane trajectories, we utilized a fine grid along with a recurrent neural network to learn the nonlinear response of hurricane trajectories. As the first author, I was able to present at a seminar for the <a href='https://www.nhc.noaa.gov'>National Oceanic and Atmospheric Administration’s (NOAA) National Hurricane Center (NHC)</a>. Following positive feedback from the NOAA scientists, we successfully published \"<a href='https://arxiv.org/abs/1802.02548'>Predicting Hurricane Trajectories using a Recurrent Neural Network</a>\" to the <a href='https://aaai.org/Conferences/AAAI-19/'>2019 Association for the Advancement of Artificial Intelligence (AAAI)</a> conference under the applied artificial intelligence track to introduce deep learning as a way to enhance the environmental forecasting techniques employed by NHC.</p><p><a href='https://github.com/sheilaalemany/hurricane-rnn'>Here is the Github repository for this project</a>. This work was completed under the mentorship of <a href='http://www.ganzfriedresearch.com'>Dr. Sam Ganzfried</a>, and the undergraduate students who kept working with me after SparkDev's program ended are <a href='https://www.linkedin.com/in/jonathanbeltranus/'>Jonathan Beltran</a> and <a href='https://www.linkedin.com/in/adrianmperez/'>Adrian Perez<a>.",
	"date": "August 2017 - November 2018",
	"category": "Independent Research Project",
    "image1": "images/latest/imageh_1.jpg",
	"image2": "images/latest/imageh_2.jpg"
  },
  "dataprediction":{
	  "key": "3",
    "title": "Data Prediction for resource-constrained devices in IoT",
    "description": "This project for mobile wireless sensor networks (MWSN) and the Internet of Things (IoT) predicts future data streams using the abstracted behavior of historical data. The project consisted of using the candlestick data structure, commonly used in currency market analysis, to partition the data. Then, it uses dynamic time warping as a similarity metric, and a support vector machine for trend prediction.</p><p>I assisted in the development of these techniques. Then,  I completed their implementation and simulated them using Python. Our approach can improve the space complexity of the data collected in MWSN without losing any behavioral information about the data. As the data collected in the field expands, our algorithms could allow for extended sensor durability in mobile wireless sensor networks. Lengthened sensor endurance will facilitate many applications that require minimal human interference to improve, such as environmental and health monitoring, and robotics. The work has been successfully published as a workshop paper in the <a href='https://workshop.euranova.eu/bigdata18.html'>2018 Third Workshop on Real-time + Stream Analytics in Big Data + Stream Data Management</a> called \"Using Candlestick Charting and Dynamic Time Warping for Data Behavior Modeling and Trend Prediction for MWSN in IoT.\"</p><p>This work was completed under the mentorship of <a href='https://www.cis.fiu.edu/faculty-staff/pissinou-niki/'>Dr. Niki Pissinou</a> and I worked closely with her Ph.D. student <a href='https://www.linkedin.com/in/concepción-sánchez-alemán-27571654/'>Concepcion Sanchez Aleman</a>.",
	"date": "January 2018 - November 2018",
	"category": "Volunteer Research Project",
    "image1": "images/latest/imagep_1.jpg",
	"image2": "images/latest/imagep_2.jpg"
  },
  "neuralgonna":{
	  "key": "4",
    "title": "Neural Gonna Give You Up",
    "description": "This project was completed during a 24-hour hackathon at the <a href='https://uhack2017.devpost.com'>University of Miami's 2017 UHack</a>. Two peers (<a href='http://markfajet.me'>Mark Fajet</a> and <a href='https://www.linkedin.com/in/jonathanbeltranus/'>Jonathan Beltran</a>) and I applied a recurrent neural network using Python and Keras manipulate any musical beat into Rick Astley's Never Gonna Give You Up. We did this by separating each instrument and training one neural network per instrument. Then, we stitched the musical tracks back together to make the beat.</p><p>The biggest challenge we faced was correctly parsing through MIDI files since none of us had any music theory experience. The results did not work as well as we had hoped and, given the time constraints, we got the drums working correctly. This comedic project won <a href='https://devpost.com/software/neural-gonna-give-you-up'>Best Artificial Intelligence and Machine Learning Hack</a>, and we were able to gain more experience in neural networks along with some knowledge of music theory. <a href='https://github.com/sheilaalemany/Neural-Gonna-Give-You-Up'>Here is the Github repository for this project</a>.",
	"date": "December 2017",
	"category": "UHack 2017 Hackathon",
    "image1": "images/latest/imagen_1.jpg",
	"image2": "images/latest/imagen_2.jpg"
  },
  "dynamictrust":{
	  "key": "5",
    "title": "MWSN Dynamic Trust Establishment",
    "description": "My work in dynamic trust establishment for mobile wireless sensor networks (MWSN) began while in the <a href='https://www.usaeop.com'>Army Educational Outreach Program</a> at Florida International University (FIU). I was able to implement and simulate a light-weight technique for data cleaning in MWSN that used an economic model to determine the trustworthiness of candidate sensors to improve data accuracy. This work, called \"<a href='https://ieeexplore.ieee.org/document/8390320'>Context-Aware Data Cleaning for Mobile Wireless Sensor Networks: A Diversified Trust Approach</a>,\" was successfully published in <i><a href='http://www.conf-icnc.org/2018/'>2018 International Conference on Computing, Networking and Communications (ICNC)</a></i>. This project was my first exposure to this domain and I was able to implement, simulate, and evaluate the developed technique.</p><p>Shortly after that, I participated in the <a href='http://it2.fiu.edu/it2_REU.php'>Research Experience for Undergraduates</a> (REU) at FIU in the summer of 2017. During that time I collaborated in two projects. One consisted of improving upon the work done as a Research Assistant for the Army Educational Outreach Program, including making the method more robust with less user-defined parameters. This work, called \"<a href='https://ieeexplore.ieee.org/abstract/document/8455888'>A Dynamic Trust Weight Allocation Technique for Data Reconstruction in Mobile Wireless Sensor Networks</a>,\" was successfully published in <i><a href='http://www.cloud-conf.net/trustcom18/'>2018 International Conference On Trust, Security And Privacy In Computing And Communications (TrustCom)</a></i>. The second project formally applied category theory to data cleaning for MWSN and we found ways the decision-making method would benefit from categorically organizing the data each sensor receives. My contribution to the projects during the REU were more hands-on as I was able to actively participate in the development of the techniques in addition to implementing and simulating the methods.</p><p>I was able to learn about the research methodology, the power of mobile wireless sensor networks, and how to use various tools such as MATLAB and the BonnMotion Mobility Generation and Analysis Tool. All these projects were completed under the close mentorship of <a href='https://www.cis.fiu.edu/faculty-staff/pissinou-niki/'>Dr. Niki Pissinou</a> and her Ph.D. student, <a href='https://www.linkedin.com/in/concepción-sánchez-alemán-27571654/'>Concepcion Sanchez Aleman</a>. These experiences inspired me to pursue a Ph.D.",
	"date": "August 2016 - December 2017",
	"category": "Research Internship",
    "image1": "images/latest/imagem_1.jpg",
	"image2": "images/latest/imagem_2.jpg"
  },
  "nanodegree":{
	  "key": "6",
    "title": "Udacity's Deep Learning Nanodegree",
    "description": "Through <a href='https://www.udacity.com/course/deep-learning-nanodegree--nd101'>Udacity's nanodegree program</a> I learned the foundations of deep learning using neural networks to complete tasks such as image classification with convolutional neural networks, speech/text translation with recurrent neural networks, and image generation using generative adversarial networks. I was able to learn this using Python and Tensorflow through five main projects.</p><br><h4>Project 1</h4><p>In this project, I built a simple neural network from scratch that predicts bike sharing rides for a bike shop, or how many bikes the bike shop may need based on the amount of expected customers in a certain month. This project allowed me to use the concepts learned up to this point, such as gradient descent and backpropagation.</p><br><h4>Project 2</h4><p>In this project, I classified images from the CIFAR-10 dataset. I used a convolutional neural network to classify images of airplanes, dogs, cats, and other objects. This project allowed me to learn about convolutional neural networks, max pooling, dropout, and fully connected layers.</p><br><h4>Project 3</h4><p>In this project, I generated Simpsons TV scripts using a recurrent neural network using a dataset that contained the scripts from 27 seasons of the Simpsons. This project allowed me to learn about recurrent neural networks using LSTM cells.</p><br><h4>Project 4</h4><p>In this project, I translated sentences from English to French using a sequence to sequence recurrent neural network. The model was trained on English to French. Project 3 and 4 allowed me to practice text preprocessing including methods to encode, decode, tokenize, and pad.</p><br><h4>Project 5</h4><p>In this project, I generated images of human faces using a generative adversarial neural network. The model was trained using two datasets, MNIST and CelebA. The MNIST dataset is used to first to train and test the model as it is a simple dataset containing handwritten digits. The CelebA dataset contains over 200,000 celebrity images with annotations. This project allowed me to learn about generative adversarial neural networks containing a discriminator neural network and generator.</p><p><a href='https://github.com/sheilaalemany/udacity_deep_learning'>Here is the Github repository for these projects</a>. I have been able to use the content taught in this nanodegree during various projects, including <a href='/generic_project.html?project=neuralgonna'>a hackathon project</a> and <a href='/generic_project.html?project=hurricane'>an independent research project</a>.",
	"date": "August 2017-December 2018",
	"category": "Deep Learning Nanodegree",
    "image1": "images/latest/imageu_1.jpg",
	"image2": "images/latest/imageu_2.jpg"
  },
  "apriori":{
	  "key": "7",
    "title": "Data mining using GPU Parallel Computing",
    "description": "In this project, three classmates and I parallelized the commonly used learning association rule mining algorithm called Apriori. This algorithm consists of detecting the most frequent combinations of different attributes in the data. For example, the algorithm could identify various groceries that were frequently bought together for stores to get some feedback on how they might organize their products in the future. The parallelization was completed by separating a set of transactions across various cores and then calculating the relationships in each transaction using multithreading. From this project, I was able to learn about some background behind data mining algorithms along with experience using NVIDIA's parallel computing platform, CUDA.</p><p>This approach was completed as a final project for my Computer Organization course which required us to carry out a research project with a novel contribution using C and CUDA. <a href='https://github.com/sheilaalemany/aprioriCUDA'>Here is the Github repository for this project</a>.",
	"date": "August 2016 - December 2016",
	"category": "Computer Organization Final Research Project",
    "image1": "images/latest/imagea_1.jpg",
	"image2": "images/latest/imagea_2.jpg"
  },
  "blockchain":{
	"key": "1",
    "title": "Blockchain technologies in Iot",
    "description": "Blockchain technologies in the Internet of Things (IoT) are recently being used to develop a massive decentralized peer-to-peer sensor network. Due to the energy and computational capacity required from the blockchain, it is difficult to scale. Currently, I am building a light-weight, scalable blockchain open-source framework on the <a href='https://www.hyperledger.org/projects/sawtooth'>Hyperledger Sawtooth platform</a> that is suitable for resource-constrained devices in IoT.</p><p>In this framework, I am implementing a novel algorithm which augments blockchain blocks from groups of sensor nodes to maximize the blockchain efficiency. I selected the Hyperledger Sawtooth framework as my platform for this project because Sawtooth targets the use of minimal resource consumption. Our goal with this project is to complete a framework that can be employed by resource-constrained sensors and can be easily employed in various applications. Since this is my first exposure to the blockchain, I am looking forward to learning about the ins and outs of this technology and, eventually, find other applications that may benefit from this technology.</p><p>This work is currently being completed under the close mentorship of <a href='https://www.cis.fiu.edu/faculty-staff/pissinou-niki/'>Dr. Niki Pissinou</a> and her Ph.D. student Abdur R. Shahid. The framework will be posted on Github publicly under the Apache License Version 2.0 software license once the project is completed.",
	"date": "November 2018 - Present",
	"category": "Research Project",
    "image1": "images/latest/imageb_1-replacement.jpg",
	"image2": "images/latest/imageb_2-replacement.jpg"
  }
}
